import React from "react";

import './Post.css'

const Post =()=>{

    return(

        <div className="post-container">

            <p>
            მე ვარ როლანდ ართმელაძე დამწყები ვებ დეველოპერი.

ციფრული სამყარო ბავშვობიდან მაინტერესებდა, ეს რაღც ჯადოსნუირ გარემო იყო რომელიც მიუწვდომელი მეჩვენებოდა, მაინტერესებდა ისეთი გამოწვევების გადაჭრა როგორიცაა:

ბრაუზერის ეკრანზე მონაცემების გამოტანა, მათი მდგომარეობის განსაზღვრის და დინაიური მოქმედების პრინციპია.

მას შემდეგ ძალიან დიდი დრო გავიდა და ეს სფერო კიდევ უფრო მრავალფეროვანი გახდა, ტექნოლოგიების მიღწევების წყალობით, ახლა უკვე შესაძლებელია მუშაობა მსოფლიოს ნებისმიერი ადგილიდან, მხოლოდ ლეპტოპით და ინტერნეტით. ამან გახსნა შესაძლებლობების სამყარო, იმ ადამიანებისთვის, რომლებსაც სურთ მოგზაურობა, საზღვარგარეთ ცხოვრება ან უბრალოდ მეტი მოქნილობა თავიანთი სამუშაოს შესრულების დროს.

ეს იყო ერთ-ერთი გარეომება რის გამოც გადავწყვიტე რომ ისევ მეცადა, უკეთ გავცნობოდი ამ სამყაროს და ბავშვობის დროინდელი სურვილები თუ ოცნებები ამესრულებინა.

სანამ სწავლას დავიწყებდი შვეცადე გავცნობორი იმ შესაძლებლობებს რითაც შემეძლო მიზნის მიღწევა და ამ სფეროში საკუთარი სიტყვის თქმია, დავიწყე ძებნა იმ ადამიანებისა ვინც უკვე ეცნობოდნენ ამ მიმართულებას და მის პრინციპებს, ვთხოვე გაეზიარბინათ გამოცდილება და მოლოდინები. რამაც გარკვეული წარმოდგენა შემიქმნა თუ რაზე უნდა ვყოფილიყავი ორიენტირებული რომ მაქსიმალური შედეგის ჩვენება შემძლებოდა.

გადავწყვიტე Front End Developer - ის პროფესიის შესწავლა, რაც როგორც ავღნიშნე ბავშვობიდან მიზიდავდა, ეს იყო მომხმარებლის ისნერფეისისი შექნმა რაც გულისხმობს:

მომხმარებლის სურვილების, ინტერესების, შესაძლებლობებისა და მოთხოვნების განსაზღვრას, მისთვის კომფორტული, მოსახერხბელი გარემოს შექმნას სამუშაო თუ გასართობი ან სასწავლო გარემოსთვის ციფრულ სამყაროში.

როგორც ავღნიშნეთ ეს მიმართუება სწრაფად ვითარდება და თითოეული ჩვენგანის ცხოვრებაში დიდი როლი აქვს. მეგორბული მარტივი და კომფორტული გარემო კი მას კიდევ უფრო მიმზიდველს ხდის. სწორედ ეს იყო ჩემი მოტივაცია ამ მიმართულების ასარჩევას.

ახლა კი დრო იყო მომეძებლა ის შსაძლებლობები საიდანაც მაქსიმალურად შევძლებდი მიზნის სისაღწევად საჭირო უნარების სწორად და სრულყოფილად განვითარებას. მოვიძიე რამდენიმე ორგანიზაცია რომელიც ასწავლიდა ამ მიმართულებით და იძლეუდა მრავალეროვან, საინტერესო დაპირებებს სამომავლო განვითარების პრსპქტივბის შესახებ.

წარმომადგენლებთან გასაუბრების დროს შევამჩნიე მათი პრიორიტეტულობა იმ გარემოებებზე რა უფრო მეტად მარკეტინგული იყო და დამრჩა განცდა რომ ჩემს „გამოჭერას“ ცდილობდნენ.

დავიწყე სხვა გამოსავლის ძებნა დავესწარი გაცნობით შხვედებს სადაც განიხილავდნენ სწორედ იმ მრავალფეროვან შესაძლებლობებს რომელსაც თანამდროვე ციფრული სამყარო გვთავაზობს. აღმოვაჩინე ადამანები ვისაც უბრალოდ სურვილი ჰქონდათ საკუთარი გამოცდილება სხვებისთვის გაეზიარებინათ. დავიწყ იმ არხებისა და რსურსების ძებნა საიდანაც საჭირო ინფორმაციის მიღებას შევძლებდი.

სწორედ ამ დროს აღმოვაჩინე BictCamp.ge ვებ გვერდისა და სოციალური გვერდების გაცნობის შემდეგ ვნახე უამავი რესურსი რომელიც ხელმისაწვდოვი იყო უფასოდ და რაც მთავარია ქართულად, ვიფიქრე დასაწყისში კარგი იქნებოდა თუ ძირითადი პრინციპების გაცნობას მშობიურ ენაზე შევძლებდი ეს მომცემდა უკეთ გააზრეისა და გაგების შესაძლებლობას რაც დამწყებისთვის განსაკუტრებით მნივნელოვანია, ასვე აქ მქონდა შესაძლებლობა სირთულეებთან შეხვედრის შემთხვევაში მეთხოვა და გამოცდილების გაზიარება.

ხანოკლე დაკვირვების შემდეგ მივხვდი რომ ძალიან მეგობრული უშუალო და სწრაფად მზარდი გარემო იყო რაც შესაძლებლობებს ზრდიდა ამან დიდი გავლენა იქონია ჩემს არჩევანზე და დღეს მიხარია რომ სწაი არჩევანი გავაკეთე. საბოლოო ჯამში სწავლა დავიწყე დამოუკიდებლად BitCamp - ის უფასო რესურსების გამოყენებით 2022 წლის დასაწყისში.

თავიდან ძირითადი პრინციპებისა და კონცეციების გაცნობით დავიწყე. აღმოვაჩინე რომ არცისე რთული იყო როგორც წარმომედგინა და ბევრად უფრო სახალისო და საინტერესო გამოდგა ვიდრე ვვარაუდობდი. პროგრამირება, პრინციპებისა და კონცეციების თეორიული გააზრების გარდა უამრავ პრატიკას მოითხოვს, საჭიროა ერთგვარი პრაქტიკული ჯაჭვის შექმნა რაც თეორიულად მიღებილი ცოდნის პრაქტიკულ გამოყენებას გულისხმობა, მნიშვნელოვანია ეს ჯაჭვი იყოს უწვეტი რათა არ მოხდეს შეძენილი უნარებისა თუ ცოდნის გადავიწყება,

ყველაფერი ეს ძალიან დიდი დროს და რესურსს მოითხოვს რაც არცისე მარტივია როცა პარალელურად ცხოვრებისეული გამოწყეყების გადალახვაც გიწევს.

ზოგჯერ დგება მომენტი როცა არჩევანი უნდა გააკეთო და ამ დროს საკუთარი თავის რწმენა ძალიან მნიშვნელოვანია. როდესაც აღმოვაჩინე რომ ჩემი შესაძლებლობები არ იყო საკმარისი რამოდენომე პროცესში ერთდროულად მონაწილეობისთვის და საკმარის დროს ვერ ვუთმობდი ვერცრთ მათგანს, გადავწყვიტე სამსახურიდან წამოსვლა და მიზნის მისაღწევად მეტი დროისა თუ ყურადღების მობილიზება.

ეს არცისე მარტივი გადაწყვეტილება იყო რადგან დასაწყისში ვერ ხედავ საკუთარი თავის პერსპექტივას და ასე თუ ისე გჭირდება რარაც რესურსი თუნდაც ელემენტარული მოთხოვნებისთვის მაგრამ ეს ერთ ერთი გამოწვევაა რომლის გადალახვაც უმეტეს შემთხვევაში საჭიროა, ამასთან ერთად როგორც ერთხელ მოვისმინე „როდესაც სამსახური მივატოვე და მთელი ჩემი დრო საჭირო ცოდნის მიღებას დავუთმე, ჩემს ირგვლივ მყოფი ნაცნობი თუ ახლობელი ადამიანები უცნაურად, განსხვავებულად მიყრებდნენ.“ ეს ნამდვილად ასეა და სიმართლე გითხრათ უცხო თვალისთვის სანახავად ეს მართლაც განსხვავებული და უცნაურია, მაგრამ როგორც ავღნიშნე მთავარი მიზნისკენ სვლაა. სწავლა და ბრძოლა.

ამ პროცესში შევხდი უამრავ ისეთ გამოწვევას რომელიც საკმაოდ რთული და კომპლექსირი აღმოჩნდა. არაერთხელ ვიფიქრე რომ არასწორი არჩევანი გავაკეთე და ეს არ იყო ის რასაც შევძლებდი მაგრამ ყოველი ასეთი მომენტისთვის მხვდებოდა იმ ადამიანების წარმატება და თავდაუზოგავი შრომა მათი მიზნების მისაღწევად. მათი ისტორიების გაცნობა ძალიან დიდი მოტივაცია იყო ჩემთვის რომ არ გავჩერებულიყავი.

მართლაც ალბათ ყველა ჩვენგანმა უნდა ვაღიაროთ სწორი მოტიაცის ძალა და შესაძლებლობები, ის საშუალებას გვაძლევს მივიღოთ სწორი გადაწყვეტილებები მიზნის მისაღწევად, BitCamp -ში კი ყოვლდღიურად უამრავი ადამიანი ზრუნავს ჩვენი მოტივაციის ამარლებაზე, საკუტარი გამოცდილების შესაძლებლობების და მიზნების გაზიარებითა, დახმარების დიდი სურვილით რადგან რაღაც ეტაპზე ეს თითოეული ჩვნგანისთვის აუცილებელია.

საწვლის პროცესში ჩემს ირგვლივ აღმოვაჩინე ადამიანები რომლებსაც სჭირდებოდათ გარკვეული საკითხების გადაჭრა და ეს შესაძლეებლი იყო იმ უნარებიი გამოყენებით რომელიც უკვე შევიძინე და სამომავლოდ მათ განვითარებას ვგეგმავდი, სწავლის პარალელურა დავიწყე პროექტებზე მუშაობა სადაც შესაძლებლობა მქონდა ჩემი უნარების პრქტიკაში გამოყენებისა და მიღებული შედეგების გაუნჯობესებისთვის თვალის დევნებისა, ჯამში მივიღე გამოცდილება რომელიც სასიცოცხლოდ აუცილებელია ამ სფეროშ თავის დასამკვიდრებლად.

პარალელურად თვალს ვადევნებდი BitCamp -ის საზოგადოების ზრდასა და განვიარებას რაც სასიამოვნო პროცესუია როგოც თითოეული ჩვენგანის ასევე მთელი ქვეყნისთვის. აქ ადამიანები ცდილობე კომფორტილი, სასიამოვნო და საინტერსო სასწავლო გარემოს შეტავაზბას ნებისმიერი მსურველისთვის უამრავი უფასო თუ სხვა სახის შეთავაზებსი გზით

სწორედა ახლა იწყება საბავშვო პროგრამა „BitCampKids“. რომლიც ითვალისწინებ ბავშვებისთვის პროგრამირების ძირითადი პრინციპების სწავლებას, საერთაშორისორისოდ აღიარბილი სასწავლო პროგრამის შესაბამისად, საინტერესო, სახალისო, მარტივი და თანმიმდევრული ეტეპების გავლით, რაც ბავშვს მისცემს შესაძლებლობას შეიძინონ ისეთი აუცილეელი უნარები როგორიც არის:

პრობლემის სწორი გააზრება

გადაჭრისთვსი საჭირო გზების პოვნა

თანმიმდევრული სწორი მოქმედებების დაგეგმვა

ეს უნარები ბავშვებს დაეხმარებათ არამხოლოდ პროგრამირებაში არამეტ რეალურ გარემოში რეალური გამოწვევების გადალახვის დრო რც ძალიან მნიშვნელოვანია მათი სწორი განვითარებისა და სწორი მიზნების ჩამოყალიბებისთვის.

როგორც ავღნიშნე ბავშვობიდან მიზიდავდა და მხიბლავდა ციფრული სამყარო, მისი შესაძლებლობები. უნდა ავღნიშნო რომ ამ ასაკში ბავშვებისთვის სწორი მაგალითის ჩვენება, მისი დახმარება და უბრალო თანადგომაც კი ძალიან მნიშვნელოვანია. სწორედ ეს აღმოჩნდ ახალი მოტივაცია ჩემთვის, რომ საკუთრი გამოცდილება და ცოდნა გამეზიარებინა იმ პატარა მეგობრებისთვის რომლებიც სწორედ ახლა დგამენ თავის პირველ ნამიჯებს ცხოვრებისეულ ასპარეზე დღეს მათთვის უმმნიშვნელოვანესია თანადგომა და ცონდნის გაზიარება მეტი მოტივაციისთვსი. როლანდ ართმელაძე
            </p>
            </div>
    )
}

export default Post;