[
    {
      "title": "Devops Engineer",
      "company": "for a small business: Web developer",
      "datatime": "Jun 2023 - Sep 2023 · 4 mos",
      "description": "I developed a custom React application that allows the owner to add a user to systematically make purchases at different times of the day at a pre-agreed price. The application calculates customer balances and receivables from product sales, saving Mflogel's time and resources for further calculations."
    },
    {
      "title": "Freelance Web Developer",
      "company": "შპს ს.ტემუ: Web developer",
      "datatime": "Apr 2023 - Jun 2023 · 3 mos",
      "description": "This is an information website created by me on JavaScript and HTML with the function of buying and selling products by the user, checking and changing stock in the warehouse, and has the function of adding and correcting data."
    },
    {
      "title": "Project Administrator",
      "company": "შპს ს.ტემუ: Team Leader",
      "datatime": "Apr 2023 - Jun 2023 · 3 mos",
      "description": "The project included the preparation of a web page with information, user interface and backend for the company, where it would be possible for the user to view the balances in the company's warehouse, as well as the accounting and updating of the balances and supplies received or issued by the company in real time, as well as the addition of communication channels and information."
    },
    {
      "title": "Web Developer",
      "company": "vacation in georgia: Developer",
      "datatime": "Jan 2023 - Apr 2023 · 4 mos",
      "description": "I designed and created an information website for a travel company, using WordPress, where users can see contact data and general data, current offers and make an order, book a specific tour, write an evaluation or feedback, express their opinion, and establish communication with responsible persons."
    },
    {
      "title": "Social Media Manager",
      "company": "vacation in georgia: Media Manager",
      "datatime": "Mar 2020 - Mar 2021 · 1 yr 1 mo",
      "description": "I carried out the preparation of social media platforms, the preparation of the content necessary for advertising, the placement of advertising and its monitoring, the determination of the target audience and the offer of the necessary product of interest to them, the communication with the users and the redirection to the relevant responsible persons. Receiving and sorting orders for easy orientation."
    }
  ]
  